app/controllers/billing_controller.rb

SELECT * FROM "transactions" WHERE ("transactions"."id" = 1)
---
  def invoice
    @transaction = Transaction.find(params[:id])

UPDATE "subscriptions" SET "plan_name" = 'premium', "updated_at" = '2008-12-20 16:26:13' WHERE "id" = 1
---
  def change_plan
    params[:subscription] ||= {}
    @subscription.plan_name = params[:subscription][:plan_name]
    if @subscription.save

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "accounts" SET "owner_id" = 9, "updated_at" = '2008-11-30 10:54:05' WHERE "id" = 5
---
  def change_owner
    @user = User.find(params[:owner_id])
    current_account.owner = @user
    current_account.save!