app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users".account_id = 5)
---
  def index
    @users = current_account.users.all

INSERT INTO "users" ("salt", "updated_at", "activated_at", "crypted_password", "account_id", "deleted_at", "remember_token_expires_at", "activation_code", "remember_token", "identity_url", "first_name", "last_name", "email", "created_at", "state") VALUES('78b2518a94293355bd1ca32376c908d26ea1aec8', '2008-12-21 14:00:10', NULL, '2ccba162174fee5039f6272c715961ae32f35f1c', 5, NULL, NULL, 'dc0f7610bd4679d5be2a6c481222c89d5840e5fa', NULL, NULL, 'Richard', 'MacCaw', 'info@vure.org', '2008-12-21 14:00:10', 'pending')
---
  def add_user
    if request.post?
      @user = User.new(params[:user])
      @user.account = current_user.account
      @user.password_confirmation = @user.password
      if @user.save

SELECT * FROM "users" ORDER BY users.id DESC LIMIT 1
INSERT INTO "users" ("salt", "updated_at", "activated_at", "crypted_password", "account_id", "deleted_at", "remember_token_expires_at", "activation_code", "remember_token", "identity_url", "first_name", "last_name", "email", "created_at", "state") VALUES('37b00cb9564d90318b9dec169cdfe76fb4fbb25d', '2008-12-20 23:55:16', NULL, 'aa5afab6bbe498a381798faf31d9afaa1b74c721', NULL, NULL, NULL, 'c733723b510042b13d555dc935f8381b69f3c68a', NULL, NULL, 'Test', 'Test', 'alex@vure.org', '2008-12-20 23:55:16', 'pending')
INSERT INTO "accounts" ("updated_at", "callback_url", "turk", "api_key", "allowed_languages", "synced_at", "profane_filter", "owner_id", "attack_filter", "instructions", "language_filter", "created_at", "state") VALUES('2008-12-20 23:55:16', NULL, 't', '92f25f10-b11f-012b-3f1c-0019e341a0ca', '''', NULL, 't', 11, 't', NULL, NULL, '2008-12-20 23:55:16', 'pending')
INSERT INTO "subscriptions" ("plan_name", "updated_at", "account_id", "last_charge_error", "next_renewal_at", "auth_code", "state", "created_at") VALUES('basic', '2008-12-21 11:28:02', 7, NULL, '2009-01-20 00:00:00', NULL, 'trial', '2008-12-21 11:28:02')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    @subscription = Subscription.new(params[:subscription])
    @subscription.state = 'trial'
    @subscription.plan_name ||= 'basic'
    @subscription.card = params[:card]
    @account = Account.new
    # We have to check if the records are valid before saving
    # since (even in a transaction) the callbacks are called
    [@user, @subscription].each {|ins|
      raise ActiveRecord::RecordInvalid.new(ins) unless ins.valid?
    }
    User.transaction do
      @user.save!
      @account.owner = @user
      @account.save!
      @user.update_attribute(:account, @account)
      @subscription.account = @account
      @subscription.save!

SELECT * FROM "users" WHERE ("users"."activation_code" = '7b25dc08e4af570a82eceda2d5ce912de0a4cefd') LIMIT 1
---
  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:id]) unless params[:id].blank?

SELECT * FROM "accounts" WHERE ("accounts"."id" = 5)
SELECT * FROM "users" WHERE ("users"."id" = 3 AND ("users".account_id = 5))
---
    def find_user
      if account_owner? && params[:id]
        @user = current_user.account.users.find(params[:id])